server/tests/load/artillery-iot.yml
config:
  target: "http://localhost:3000"
  phases:
    # IoT device startup - mass connection
    - duration: 60
      arrivalRate: 500 # Many devices connecting at once
      name: "IoT Device Startup"
    # Normal IoT operation
    - duration: 1800 # 30 minutes
      arrivalRate: 100 # Regular heartbeat intervals
      name: "Normal IoT Operation"
    # Peak RFID scanning (class change times)
    - duration: 300 # 5 minutes
      arrivalRate: 300
      name: "Peak RFID Scanning"
    # Low activity period
    - duration: 600 # 10 minutes
      arrivalRate: 20
      name: "Low Activity Period"
  defaults:
    headers:
      X-Device-Api-Key: "{{ deviceApiKey }}"
      Content-Type: "application/json"
  processor: "./artillery-processor.js"

scenarios:
  - name: "Device Heartbeat"
    weight: 60
    flow:
      - post:
          url: "/api/iot/heartbeat"
          json:
            status: "online"
            batteryLevel: "{{ $randomInt(20, 100) }}"
            signalStrength: "{{ $randomInt(-70, -20) }}"
            temperature: "{{ $randomInt(15, 35) }}"
            uptime: "{{ $randomInt(3600, 86400) }}"
          expect:
            - statusCode: 200

  - name: "RFID Attendance Scan"
    weight: 40
    flow:
      - post:
          url: "/api/iot/attendance/rfid"
          json:
            rfidUid: "{{ generateRFID }}"
            timestamp: "{{ $isoTimestamp }}"
          expect:
            - statusCode: 200

# IoT-specific performance thresholds
ensure:
  p95: 500 # 95th percentile < 500ms for IoT responses
  p99: 1000 # 99th percentile < 1 second
  rps: 200 # Minimum 200 IoT requests per second


# Note: Device API key must be provided via LOADTEST_DEVICE_API_KEY.