server/tests/load/artillery-mobile.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Morning app usage spike
    - duration: 300
      arrivalRate: 150
      name: "Morning App Usage Peak"
    # Class time - moderate usage
    - duration: 1800
      arrivalRate: 50
      name: "Class Time Usage"
    # Break times - high usage
    - duration: 600
      arrivalRate: 100
      name: "Break Time High Usage"
    # Evening - low usage
    - duration: 600
      arrivalRate: 20
      name: "Evening Low Usage"
  defaults:
    headers:
      Authorization: "Bearer {{ auth_token }}"
      User-Agent: "MobileApp/{{ $randomInt(1, 3) }}.{{ $randomInt(0, 9) }} ({{ $randomInt(0, 1) === 0 ? 'iOS' : 'Android' }})"
      Content-Type: "application/json"
  processor: "./artillery-processor.js"

scenarios:
  # Mobile Authentication
  - name: "Mobile Login"
    weight: 10
    flow:
      - post:
          url: "/api/mobile/login"
          json:
            email: "{{ $randomInt(0, 1) === 0 ? generateStudentEmail : generateFacultyEmail }}"
            password: "password123"
            deviceId: "mobile_device_{{ $randomInt(1, 500) }}"
            pushToken: "push_token_{{ $randomInt(100000, 999999) }}"
          expect:
            - statusCode: 200
          capture:
            json: "$.token"
            as: "auth_token"

  # Attendance Checking
  - name: "Check Attendance Status"
    weight: 25
    flow:
      - get:
          url: "/api/mobile/attendance-status"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          expect:
            - statusCode: 200

  - name: "Mark Self Attendance"
    weight: 20
    flow:
      - post:
          url: "/api/mobile/attendance"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          json:
            location: {
              latitude: "{{ 37.7749 + ($randomInt(-100, 100) / 10000) }}",
              longitude: "{{ -122.4194 + ($randomInt(-100, 100) / 10000) }}",
              accuracy: "{{ $randomInt(5, 50) }}"
            }
            timestamp: "{{ $isoTimestamp }}"
          expect:
            - statusCode: 201

  # Schedule Viewing
  - name: "View Daily Schedule"
    weight: 15
    flow:
      - get:
          url: "/api/mobile/schedule"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          qs:
            date: "{{ $isoTimestamp }}"
          expect:
            - statusCode: 200

  # Notifications
  - name: "Fetch Notifications"
    weight: 12
    flow:
      - get:
          url: "/api/mobile/notifications"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          qs:
            limit: 20
            unreadOnly: "{{ $randomInt(0, 1) }}"
          expect:
            - statusCode: 200

  # Profile Management
  - name: "Update Profile"
    weight: 8
    flow:
      - put:
          url: "/api/mobile/profile"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          json:
            emergencyContact: "Parent {{ $randomInt(1, 100) }}"
            phone: "+1{{ $randomInt(2000000000, 9999999999) }}"
          expect:
            - statusCode: 200

  # Offline Sync
  - name: "Sync Offline Data"
    weight: 10
    flow:
      - post:
          url: "/api/mobile/sync"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          json:
            lastSync: "{{ new Date(Date.now() - $randomInt(3600000, 86400000)).toISOString() }}"
            pendingAttendance: [
              {
                timestamp: "{{ $isoTimestamp }}",
                location: { latitude: 37.7749, longitude: -122.4194 }
              }
            ]
          expect:
            - statusCode: 200

# Mobile-specific performance thresholds
ensure:
  p95: 1500  # 95th percentile < 1.5 seconds (mobile networks)
  p99: 3000  # 99th percentile < 3 seconds
  rps: 80    # Minimum 80 mobile requests per second

# Mobile metrics
metrics:
  - name: "Mobile Logins"
    capture: json: "$..mobileLogins"
  - name: "Self Attendance Records"
    capture: json: "$..selfAttendanceRecords"
  - name: "Offline Syncs"
    capture: json: "$..offlineSyncs"
  - name: "Push Notifications Sent"
    capture: json: "$..pushNotificationsSent"