server/tests/load/artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    # Normal load
    - duration: 300
      arrivalRate: 20
      name: "Normal load"
    # Peak load
    - duration: 120
      arrivalRate: 50
      name: "Peak load"
    # Stress test
    - duration: 60
      arrivalRate: 100
      name: "Stress test"
    # Recovery
    - duration: 60
      arrivalRate: 10
      name: "Recovery"
  defaults:
    headers:
      Authorization: "Bearer test-jwt-token"
  processor: "./artillery-processor.js"

scenarios:
  # Authentication scenarios
  - name: "User Login"
    weight: 5
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "password123"
          expect:
            - statusCode: 200
          capture:
            json: "$.token"
            as: "auth_token"

  # Attendance scenarios
  - name: "Manual Attendance Entry"
    weight: 25
    flow:
      - post:
          url: "/api/attendance/manual"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          json:
            studentId: "{{ $randomInt(1, 1000) }}"
            classSessionId: "{{ $randomInt(1, 50) }}"
            entryTime: "{{ $isoTimestamp }}"
            notes: "Load test entry"
          expect:
            - statusCode: 201

  - name: "Get Attendance Records"
    weight: 30
    flow:
      - get:
          url: "/api/attendance"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          qs:
            limit: 50
            offset: "{{ $randomInt(0, 100) }}"
          expect:
            - statusCode: 200

  - name: "RFID Scan Simulation"
    weight: 15
    flow:
      - post:
          url: "/api/attendance/simulate-rfid"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          json:
            rfidUid: "RFID{{ $randomInt(100000, 999999) }}"
          expect:
            - statusCode: 200

  # Dashboard scenarios
  - name: "Dashboard Data"
    weight: 10
    flow:
      - get:
          url: "/api/dashboard/stats"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          expect:
            - statusCode: 200

  # Student management
  - name: "Student List"
    weight: 8
    flow:
      - get:
          url: "/api/students"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          qs:
            limit: 20
            page: "{{ $randomInt(1, 10) }}"
          expect:
            - statusCode: 200

  # IoT device scenarios
  - name: "IoT Device Status"
    weight: 5
    flow:
      - get:
          url: "/api/iot/devices"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          expect:
            - statusCode: 200

  # API health check
  - name: "Health Check"
    weight: 2
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

# Performance thresholds
ensure:
  p95: 1000  # 95th percentile response time < 1 second
  p99: 2000  # 99th percentile response time < 2 seconds
  rps: 30    # Minimum 30 requests per second

# Custom metrics
metrics:
  - name: "Attendance Records Created"
    capture: json: "$..attendanceRecordsCreated"
  - name: "RFID Scans Processed"
    capture: json: "$..rfidScansProcessed"